import { LOCALES } from '../locales'

export default {
  [LOCALES.RUSSIAN]: {
    'nav-about': 'Обо мне',
    'nav-exp': 'Мой путь',
    'nav-projects': 'Мои проекты',
    download: 'Скачать мое CV',
    'view-cv': 'Посмотреть мое CV',
    contacts: 'Контакты',
    'button-visitSite': 'Посетить сайт',
    'greeting-1': 'Привет!',
    'greeting-2': 'Меня зовут Валерия,',
    'greeting-3': 'Frontend разработчик',
    message:
      'У меня есть образование и опыт работы в сфере туризма, который я приобрела, в том числе, во время стажировок за рубежом: шесть месяцев в США в 2012 году и шесть месяцев в Турции в 2013 году. Однако, после переезда в Бельгию в конце 2017 года, я решила изменить свою карьеру и заняться веб-разработкой, областью, которая меня полностью увлекает.',
      'message-p1': "В марте 2020 года я завершила курс программирования в BeCode, после чего прошла стажировку в компании BloomingRiders. С тех пор я работаю над собственным проектом: интернет-магазином, специализирующимся на корейской косметике. Кроме того, я открыта для новых профессиональных возможностей.", 
      'message-p2': "Меня особенно привлекает фронтенд-разработка, и я стремлюсь продолжать развиваться в этой области. Я использую JavaScript и React.js — это те технологии, с которыми я работаю чаще всего и которые мне очень нравятся.", 
    'heading-education': 'Образование && опыт работы',
    'heading-projects': 'Проекты',
    country: 'Бельгия',
    'country-city': 'Шарлеруа, Бельгия',
    'date-korina': 'Ноябрь 2020 - настоящее время',
    'description-korina':
      'Моя малышка, мой интернет-магазин корейской косметики :) React.js + Next.js, автоматическое развертывание через Git CI/CD.',
    'date-becode': 'Сентябрь, 2019 - март, 2020',
    'description-becode':
      '7-ми месячные интенсивные курсы по фронтенд-разработке (HTML, CSS, Javascript), бэкенд-разработке (PHP, SQL, Adminer), системам администрирования (Linux), разработке проектов (Git). Развитие умения автономной работы и обучения, работы в команде.',
    'description-technofuture': 'Введение в HTML, JavaScript, PHP.',
    'date-blooming':
      'Апрель 2020 г. - Июль 2020 г.; Январь 2021 - Февраль 2021.',
    'description-blooming':
      'Разработка фронтэнда для обучающей платформы (React.js, GatsbyJS, Node.js, SASS, REST), автоматическое развертывание через Git CI/CD.',
    'date-aventica':
      'Январь 2022 г. - Октябрь 2023 г. (Full-time); Март 2024  г. - Май 2024 г. (Part-time)',
    'country-aventica': 'Россия',
    'description-aventica':
      'Разработка фронтэнда для компаний-клиентов (Svelt, React.js, Node.js, SASS). Большую чать времени работала над крупным проектом "Таврида": создание сайта с личным кабинетом пользователя, функционал для подачи заявок пользователями на различные типы мероприятий, разработка LMS платформы с личным кабинетом преподавателя и студента, разработка кастомной CMS платфомы.',
    Tavrida:
      'Я участвовала в крупном проекте в составе команды Aventica, используя такие технологии, как Svelte, REST, GraphQL и SCSS. Проект состоял из нескольких ключевых этапов.\nНа первом этапе была создана статичная веб-страница, включая landing page и личный кабинет для пользователей. Я полностью отвечала за разработку этого личного кабинета, как с функциональной, так и с интеграционной стороны, включая макетирование и интеграцию статичных страниц сайта.\nВторой этап включал создание кастомизированной CMS. Я продолжила разрабатывать новые функции для личного кабинета, параллельно переписывая статичные страницы, чтобы адаптировать их к особенностям CMS.\nПоследним этапом проекта стало создание кастомизированной LMS. Моя основная задача заключалась в расширении функционала личного кабинета с добавлением новых ролей (студент и преподаватель) и специфических функций для каждой из них, таких как отслеживание курсов и управление домашними заданиями для студентов, а также их проверка для преподавателей. Также я принимала участие в создании панели администратора для управления LMS, используя React.js, REST и SASS.',
    'Bessmertny polk': 'Я участвовала в национальном проекте в России в составе команды Aventica, используя такие технологии, как Svelte, REST и SASS. Моя основная задача заключалась в создании полного процесса регистрации пользователей. Это включало управление регистрацией, валидацию данных, создание и управление аккаунтами пользователей, а также интеграцию различных этапов процесса в приложение, обеспечивая тем самым плавный и безопасный пользовательский опыт.',
    A6K: 'Это был групповой проект, выполненный во время моих учебных курсов. Сайт работает уже несколько лет, но мы решили множество проблем, связанных с UI/UX, а также с функциональными ошибками.\nВ рамках этого проекта я в основном работала с JavaScript, создавая анимации, переписывая функции и анализируя код для его оптимизации и удаления ненужного кода. Поскольку сайт был разработан на WordPress, я также использовала PHP, а также некоторые функции WordPress, MySQL и Adminer для управления базой данных.\nКак групповая работа, мы также улучшили наши навыки работы с Git для управления совместной работой и контроля версий, что позволило нам работать более эффективно и грамотно управлять вкладом каждого участника.',
    ANCUBATOR:
      'Это мой первый проект в качестве фриланс-разработчика, в рамках которого я создала landing page. Этот проект позволил мне работать самостоятельно и применить мои навыки в разработке. Используемые технологии включают HTML, Bootstrap, Figma для дизайна, а также Mailchimp для интеграции форм подписки.',
    'Blooming Riders':
      'Этот проект стал настоящим вызовом в начале моей карьеры как разработчика, так как он заключался в разработке полной системы управления обучением (LMS) с нуля. Проект делится на две основные части.\nПервая часть связана с созданием административной системы, которая позволяет управлять курсами, уроками, тестами для проверки знаний, статьями, акциями, подписками и пользовательскими опросами.\nВторая часть — это сама платформа LMS. Ключевые функции включают: создание личного кабинета пользователя с дифференцированным доступом в зависимости от уровня пользователя, внедрение системы безопасных платежей, а также интеграцию системы авторизации через токены для обеспечения максимальной безопасности.\nИспользуемые технологии для этого проекта: JavaScript, React.js, Next.js и SASS.',
    Korina:
      'Я создала собственный бизнес — интернет-магазин, специализирующийся на корейской косметике. Проект состоит из двух основных частей.\nПервая часть — это полная административная система, позволяющая мне управлять брендами, продуктами, вариантами, а также складом и отслеживать статус заказов.\nВторая часть связана с самим интернет-магазином и включает несколько ключевых функций: создание личного кабинета пользователя, внедрение безопасной платежной системы, управление аутентификацией и авторизацией через токены, интеграция многоязычности с помощью плагина i18n.\nИспользуемые технологии: JavaScript, React.js, Next.js и SASS.\nС начала 2025 года сайт проходит рефакторинг с новым дизайном, и его запуск намечен на июнь 2025 года.',
    JobSwap:
      'Это мой второй проект в качестве независимого разработчика. Проект включал разработку веб-сайта, а также административной панели. Я полностью взяла на себя реализацию фронтенда, используя такие технологии, как React.js, Next.js, SASS и Figma. Этот проект также дал мне возможность впервые внедрить динамическое переключение языков, функцию, которая позволяет пользователям легко переключаться между языками.',
    'cv-name': 'Валерия Козлова',
    'cv-post': 'Frontend разработчик',
    'cv-location': 'Франция / Бельгия / Россия',
    'cv-skills': 'Навыки',
    'cv-perso-skills':
      'Умение работать как в команде, так и автономно, быстрое самообучение',
    eng: 'Английский - intermedaite',
    fr: 'Французский - intermedaite',
    ru: 'Русский - native',
    'cv-education': 'Образование',
    'tourism-place': 'Алтайский государственный технический университет',
    'tourism-ville': 'Барнаул, Россия',
    'tourism-date': '2009-2014',
    'tourism-content': 'Степень магистра. Туризм.',
    'english-place': 'Алтайский государственный технический университет',
    'english-ville': 'Барнаул, Россия',
    'english-date': '2011-2014',
    'english-content':
      'Вечерние занятия. Переводчик в сфере профессиональной коммуникации (английский).',
    'techno-place': 'Technofutur TIC',
    'techno-ville': ' Шарлеруа, Бельгия',
    'techno-date': '2019',
    'techno-content':
      'Дистанционное обучение. Введение в HTML, JavaScript, PHP.',
    'becode-place': 'BeCode',
    'becode-ville': 'Шарлеруа, Бельгия',
    'becode-date': '2019-2020',
    'becode-content':
      '7 месяцев обучения фронтенд-разработке (HTML, CSS, Javascript), back-end.',
    experience: 'Опыт работы',
    belgium: 'Бельгия',
    'cv-ANCUBATOR':
      'Лендинговая страница для стартапа. Технологии: HTML, Bootstrap, Figma, Mailchimp.',
    'cv-Blooming-Riders':
      'Разработка LMS системы с нуля. Первая часть проекта - административная система, через которую возможно создавать курсы с уроками, проверочные тесты, статьи, промоакции, абонементы, опросы пользователей. Вторая часть - сама платформа. Здесь было реализовано: личный кабинет пользователя с доступом к функционалу сайта в зависимости от уровня пользователя, внедрена система оплаты, система авторизации с помощью токенов. Технологии: JS, React.js, Next.js, SASS.',
    'date-ANCUBATOR': 'Октябрь 2019',
    'cv-JobSwap':
      'Проект включал в себя разаботку как самого сайта так и административной панели. Я реализовала весь фронтенд. Технологии: JS, React.js, Next.js, SASS, Figma. Также в первый раз я реализовала динамичекое переключение языков.',
    'date-JobSwap': 'Сентябрь - Октябрь 2020',
    'not-found-button': 'Вернуться на главную страницу',
  },
}
